#### 연습 문제 4.1.1

In [1]:
import numpy as np
import pandas as pd

In [2]:
a = pd.Series([10, 20, 30, 40],
              index=["가", "나", "다", "라"])
a

가    10
나    20
다    30
라    40
dtype: int64

In [3]:
b = pd.Series([1, 2, 3, 4],
              index=["가", "나", "다", "마"])
b

가    1
나    2
다    3
마    4
dtype: int64

In [4]:
a + b

가    11.0
나    22.0
다    33.0
라     NaN
마     NaN
dtype: float64

In [5]:
a - b

가     9.0
나    18.0
다    27.0
라     NaN
마     NaN
dtype: float64

In [6]:
a * b

가    10.0
나    40.0
다    90.0
라     NaN
마     NaN
dtype: float64

In [7]:
a / b

가    10.0
나    10.0
다    10.0
라     NaN
마     NaN
dtype: float64

#### 연습 문제 4.1.2

In [8]:
data = {
    "2021": [1, '가', 2.5, 75, '서울'],
    "2020": [2, '나', 3.14, 34, '대전'],
    "2019": [3, '다', 5.66, 36, '울산'],
    "2018": [4, '라', 1.3, 24, '경기'],
    "2017": [5, '마', 4.9, 21, '부산']
}
df = pd.DataFrame(data)
df

  2021  2020  2019 2018 2017
0    1     2     3    4    5
1    가     나     다    라    마
2  2.5  3.14  5.66  1.3  4.9
3   75    34    36   24   21
4   서울    대전    울산   경기   부산

#### 연습 문제 4.1.3

In [9]:
score = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df2 = pd.DataFrame(score, index=index, columns=columns)
df2

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [10]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df2['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [11]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df2[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [12]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df2['평균'] = df2.mean(axis=1).round(2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [13]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
del df2['평균']
df2['영어'][3] = 80
df2

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [14]:
df2['평균'] = np.round(df2.mean(axis=1),2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [15]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df2[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [16]:
# (5) 향단의 점수를 시리즈로 나타낸다.
df2.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

#### 연습 문제 4.3.1

In [17]:
# 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(1, 100, 25).reshape(5,5),
                  index=['a','b','c','d','e'],
                  columns=['v','w','x','y','z'])
df

    v   w   x   y   z
a  86  58   1  95  87
b  45  63  92  30  22
c  94  25  13  71  71
d  34   8   2  98  27
e  67  49  64  50  17

In [18]:
# 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [19]:
# 2) 63을 선택
df['w']['b'], df.w['b'], df.w[1], df.w.b

(63, 63, 63, 63)

In [20]:
df.loc['b','w'], df.loc['b']['w'], df.loc['b'][1]

(63, 63, 63)

In [21]:
df.iloc[1,1], df.iloc[1][1], df.iloc[1]['w']

(63, 63, 63)

#### 연습 문제 4.4.1

In [22]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

#### 연습 문제 4.4.2

In [24]:
# 타이타닉호 승객에 대해 성별(sex) 인원수
titanic.sex.value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

In [25]:
# 나이별(age) 인원수
titanic.age.value_counts().sort_values()

12.00     1
24.50     1
66.00     1
20.50     1
0.67      1
         ..
19.00    25
28.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [26]:
# 선실별(pclass) 인원수
titanic['class'].value_counts().sort_values()

Second    184
First     216
Third     491
Name: class, dtype: int64

In [27]:
# 사망/생존(alive) 인원수
titanic.alive.value_counts().sort_values()

yes    342
no     549
Name: alive, dtype: int64

#### 연습 문제 4.4.3

In [28]:
# 타이타닉호 승객의 평균 나이
titanic['age'].mean()

29.69911764705882

In [29]:
# 타이타닉호 승객중 여성 승객의 평균 나이
titanic_female = titanic[titanic.sex == 'female']
titanic_female.age.mean()

27.915708812260537

In [30]:
# 타이타닉호 승객중 1등실 여성 승객의 평균 나이
titanic_female_first = titanic_female[titanic_female.pclass == 1]
titanic_female_first.age.mean()

34.61176470588235

#### 연습 문제 4.4.4

In [31]:
titanic = titanic[['survived', 'pclass', 'sex', 'age']]

In [32]:
import warnings
warnings.filterwarnings('ignore')

In [33]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
# 20살이 넘으면 성별을 그대로 사용한다.
# 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [34]:
titanic["category1"] = titanic.apply(lambda x: x.sex if x.age >= 20 else "child", axis=1)
titanic

     survived  pclass     sex   age category1
0           0       3    male  22.0      male
1           1       1  female  38.0    female
2           1       3  female  26.0    female
3           1       1  female  35.0    female
4           0       3    male  35.0      male
..        ...     ...     ...   ...       ...
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female   NaN     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

[891 rows x 5 columns]

#### 연습 문제 4.4.5

In [35]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [36]:
titanic.loc[:, 'age'] = titanic.loc[:, 'age'].fillna(titanic.loc[:, 'age'].mean().round(0))
titanic

     survived  pclass     sex   age category1
0           0       3    male  22.0      male
1           1       1  female  38.0    female
2           1       3  female  26.0    female
3           1       1  female  35.0    female
4           0       3    male  35.0      male
..        ...     ...     ...   ...       ...
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female  30.0     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

[891 rows x 5 columns]

#### 연습 문제 4.4.6

In [37]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. ex) male27
titanic["category2"] = titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

     survived  pclass     sex   age category1 category2
886         0       2    male  27.0      male    male27
887         1       1  female  19.0     child  female19
888         0       3  female  30.0     child  female30
889         1       1    male  26.0      male    male26
890         0       3    male  32.0      male    male32

#### 연습 문제 4.4.7

In [38]:
# 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.
# 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels=labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [39]:
cats.value_counts()

미성년자    165
청년      407
중년      241
장년       59
노년        5
dtype: int64

In [40]:
df = pd.DataFrame(cats.value_counts(), columns=['인원수'])
df

      인원수
미성년자  165
청년    407
중년    241
장년     59
노년      5

In [41]:
df['비율(%)'] = np.round(df['인원수'] / df['인원수'].sum() * 100, 2)
df

      인원수  비율(%)
미성년자  165  18.81
청년    407  46.41
중년    241  27.48
장년     59   6.73
노년      5   0.57

In [42]:
df['비율(%)'].sum()

100.0

In [43]:
# 비율 풀이 참고

#### 연습 문제 4.4.8

In [44]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

# 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
# 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

titanic['group'] = pd.cut(titanic.age.values, bins, labels=labels)
titanic.tail()

     survived  pclass     sex   age category1 category2 group
886         0       2    male  27.0      male    male27    청년
887         1       1  female  19.0     child  female19  미성년자
888         0       3  female  30.0     child  female30    청년
889         1       1    male  26.0      male    male26    청년
890         0       3    male  32.0      male    male32    중년

In [45]:
titanic['성별'] = titanic.apply(lambda r: '남성' if r.sex == 'male' else '여성', axis=1)
titanic.tail()

     survived  pclass     sex   age category1 category2 group  성별
886         0       2    male  27.0      male    male27    청년  남성
887         1       1  female  19.0     child  female19  미성년자  여성
888         0       3  female  30.0     child  female30    청년  여성
889         1       1    male  26.0      male    male26    청년  남성
890         0       3    male  32.0      male    male32    중년  남성

In [46]:
titanic['category3'] = titanic.apply(
    lambda r: r.group + r.성별 if r.age >= 20 else '미성년자', 
    axis=1
)
titanic.tail()

     survived  pclass     sex   age category1 category2 group  성별 category3
886         0       2    male  27.0      male    male27    청년  남성      청년남성
887         1       1  female  19.0     child  female19  미성년자  여성      미성년자
888         0       3  female  30.0     child  female30    청년  여성      청년여성
889         1       1    male  26.0      male    male26    청년  남성      청년남성
890         0       3    male  32.0      male    male32    중년  남성      중년남성

#### 연습문제 4.5.1

In [47]:
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint(40, 100, 15).reshape(5,3), 
                         columns=['국어','영어','수학'])
df_score1.index = ['김판다','이판다','박판다','최판다','정판다']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94

In [48]:
df_score2 = df_score1.reset_index()
df_score2

    이름  국어  영어  수학
0  김판다  92  61  97
1  이판다  40  85  70
2  박판다  62  84  67
3  최판다  69  61  69
4  정판다  64  52  94

In [49]:
df_score2.set_index('이름')

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94